"""
Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.
"""
a = 2
b = 5

for i in range(a, b+1):
    print(i)