"""
Дано положительное действительное число X. Выведите его дробную часть.
"""
x = 1.234
print(x%1)