"""
Дано натуральное число. Выведите его последнюю цифру.
"""

a = int(input('Enter natural number\n'))
print(a%10)