"""
Дано натуральное число. Найдите число десятков в его десятичной записи.
"""

n = 73

print(n // 10 % 10)