"""
Дано два числа a и b. Выведите гипотенузу треугольника с заданными катетами.
"""

from math import sqrt

a = 3
b = 4

print(sqrt(a**2+b**2))
